In [7]:
import pandas as pd 
import numpy as np

# read the table 
columns = ["id","age","gender","jop_title","zip_code"]
df = pd.read_table("https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/u.user",sep="|", names = columns) 
df.head(10)

   id  age gender      jop_title zip_code
0   1   24      M     technician    85711
1   2   53      F          other    94043
2   3   23      M         writer    32067
3   4   24      M     technician    43537
4   5   33      F          other    15213
5   6   42      M      executive    98101
6   7   57      M  administrator    91344
7   8   36      M  administrator    05201
8   9   29      M        student    01002
9  10   53      M         lawyer    90703

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         943 non-null    int64
 1   age        943 non-null    int64
 2   gender     943 non-null    object
 3   jop_title  943 non-null    object
 4   zip_code   943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

In [9]:
# check for missing values
df.isna().sum()

id           0
age          0
gender       0
jop_title    0
zip_code     0
dtype: int64

In [10]:
#check for duplicated rows
df.duplicated().sum()

np.int64(0)

In [21]:
# know how many male and female 
df["gender"].value_counts()

gender
M    670
F    273
Name: count, dtype: int64

In [22]:
df["jop_title"].value_counts()

jop_title
student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: count, dtype: int64

In [44]:
#  to know how many m or f is student whatever
df1 = df[["gender","jop_title"]]
df1 = df1.groupby("gender").value_counts()
df1 = df1.unstack()
df1 = df1.T
df1.sort_values(by = ["M","F"],ascending=False)

gender            F      M
jop_title
student        60.0  136.0
other          36.0   69.0
educator       26.0   69.0
engineer        2.0   65.0
programmer      6.0   60.0
administrator  36.0   43.0
executive       3.0   29.0
scientist       3.0   28.0
writer         19.0   26.0
technician      1.0   26.0
librarian      29.0   22.0
marketing      10.0   16.0
entertainment   2.0   16.0
artist         13.0   15.0
retired         1.0   13.0
lawyer          2.0   10.0
salesman        3.0    9.0
doctor          NaN    7.0
healthcare     11.0    5.0
none            4.0    5.0
homemaker       6.0    1.0